app/views/posts/index.html.erb

    <div class="comLik">
    <p>Comments: <%= post.comments.count %>, Likes: <%= post.likes.count %></p>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]


  <% if post.recent_comments.any? %>
---
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT $2  [["post_id", 2], ["LIMIT", 1]]

  <% post.recent_comments.each do |comment| %>
            <% if comment.user.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]