app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
        <div class="comment-card">
          <% if comment.user.present? %>