app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "dflkdl"], ["user_id", 1], ["post_id", 6], ["created_at", "2023-11-24 18:17:05.923951"], ["updated_at", "2023-11-24 18:17:05.923951"]]
---
  def create
    @comment = current_user.comments.build(comment_params)
    @comment.post = @post

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 9]]
---
  def destroy
    @comment = Comment.find(params[:id])
    authorize! :destroy, @comment

    @comment.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_user_and_post
    @user = User.find(params[:user_id])
    @post = Post.find(params[:post_id])