app/models/comment.rb

  def update_comments_counter
    post.update(comments_counter: post.comments.count)
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5]]
UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 1], ["updated_at", "2023-12-01 17:26:40.672615"], ["id", 5]]