app/models/like.rb

  def update_like_counter
    post.update(likes_counter: post.likes.count)
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 6]]
UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 1], ["updated_at", "2023-11-24 20:15:52.058982"], ["id", 6]]